{
  "colombia.ecosystemextent.ecosystemtype#Definition#Methods" : {
    "trigger" : "DEFINITION",
    "sectionRole" : "METHODS",
    "section" : "Methods",
    "documentedId" : "colombia.ecosystemextent.ecosystemtype",
    "extended" : null,
    "template" : "@section(Colombian Ecosystem Extent)\r\nTerrestrial Ecosystem Types are modelled based on the MEC (Colombain Ecosystem Classification) database. The original classification were mapped only for the year 2011, the estimation of the ecosystem mapping was carried with limited information. The model to estimate ET is the result of a thourorugh analysis of the variable used in the MEC database to ideintify Et in 2011, whose relationship were used to estimate ET in successive years based on more recent landcover maps. The other ecological information stayed constant. \r\n\r\nThe cross-references from the resulting MEC classification to the IUCN GET follow the recomended crosswalk provided by IDEAM in @cite(MEC2017), which was endorsed by the other environamental and ecological agencies in Colombia.\r\n\r\n### Decision-tree (lookup table) optimization\r\nThe sources of information used to consolidate the database that subsequently led to the construction of the decision-tree lookup table correspond to the latest publication of the national landcover map, the CORINE Land Cover Methodology adopted for Colombia, Scale 1:100,000, from which the 2020 land cover classes were obtained; and a version 2.1 of the MEC from which the variable information was taken climate classes, preliminary biomes, biotic units, edaphogenetic environment, types of water, marine ecosystems, aquatic environment classes and degree of transformation from human activities.\r\n\r\nFrom the integration of 191 land cover classes, 35 climate classes, 12 preliminary biomes, 67 biotic units, 107 combinations of pedogenetic environment, 3 types of water, 30 marine ecosystems (derived from the INVEMAR layer), 2 classes of aquatic environment and 2 degrees of ecosystem transformation, were established near 350.000 possible combinations to identify the general ecosystems of the MEC. These combinations were consolidated into a database with 26,000 records, after eliminating repeated information. In a second stage of screening, more complex, the records were reduced to the combinations of the minimum and univocal variables that make it possible to distinguish an ET, following the methodology described below.\r\n\r\n\r\n### Selection of the minimum number of variables to map ETs\r\nTo optimize the process, an algorithm was developed that automates the selection of the minimum amount of information necessary to identify each ET, based on the determination of the combinations of variables that allow them to be classified uniquely. With this process, the redundant combinations were eliminated.\r\n\r\nThe algorithm works by iterating, only when necessary, through the available combinations from those that require fewer variables (simpler) to those that require progressively a greater number (more complex). For each combination, the algorithm checks if it is possible to obtain a single ET result. If a combination of variables is sufficient to consistently identify an ET, it is stored in an optimized relationship table, while the redundant rows, already explained by this combination, they are eliminated from subsequent analysis. In this way, the process optimizes the search for relationships, prioritizing the simplest combinations before considering the most complex ones.\r\n\r\nThis version of the model (as of Febraury 2025) map all 93 Ecosystem Types from the \"_Mec_, the Official National Colombian Ecosystem Mapping. The relationships between these variabels and the final mapping follow the lastest release fo the database, dated 2011.\r\nThe model relies on 11 ecological layers to obtain these results: \r\n+ landcover,\r\n+ pedogenetic environment/ geomorphological (soil) type, \r\n+ climatic classes,\r\n+ biomes,\r\n+ biotic units,\r\n+ water chamical properties,\r\n+ marine ecosystems (derived from the INVEMAR),\r\n+ classes of aquatic environment ,and \r\n+ degrees of ecosystem transformation\r\n\r\nThe model uses a decison-tree in which environmental, ecological and geographical layers are combined using a mullti-layer lookup table, to represent the characteristics of a particular ecosystem. The information with higher detail, quality, level of confidence or which represent ecoligical characteristic distinctive to specific ecosystems are prioritzed. The statistical model used by ARIES is based on a decision tree, which organizes the information hierarchically, and in which specific information (distinctive for a particular class or ecosystem type) takes priority over generic information (characteristics common to more classes or ecosystem types). In this model, each decision is represented as a node in the tree; and each node has multiple possible scenarios, which lead to different results. The content of the dataset used in the decision-tree model is organized using a multi-layer lookup table that synthesizes the combinations of variables and their associated results. The several combinations are arranged in order of priority to their application according to their position in the table. In this way, a combination of data and models to identify a certain output with more precision can be prioritized, leaving the “uncomputed” part to the other combinations of inputs in the model. This method is particularly useful when working with a large number of variable combinations, as it simplifies and speeds up data processing. \r\n\r\nIn practical terms, for the specific case of ET identification, priority is given to the combinations of variables that appear in the first rows of the lookup table. Each row maps only the areas that have not been identified in the previous rows. This ensures that the model applies the combinations that represent the most specific and informed assumptions first. More general cases or combinations are positioned lower in the table, allowing these scenarios to be used to map only those areas that have not been previously classified. In this way, the table allows a hierarchical strategy for the identification of the ET, where the most specific hypotheses are applied first and the most general cover previously unresolved cases.\r\n ",
    "sectionType" : "BODY",
    "documentedUrns" : [ ],
    "eventType" : null,
    "variables" : { }
  },
  "colombia.ecosystemextent.ecosystemtype#Termination#Results" : {
    "trigger" : "TERMINATION",
    "sectionRole" : "RESULTS",
    "section" : "Results",
    "documentedId" : "colombia.ecosystemextent.ecosystemtype",
    "extended" : null,
    "template" : "@section(Ecosystem Type Mapping)\r\n\r\n---\r\n@figure(self, EcosystemTypeMapping)\r\n@link(self, EcosystemTypeMapping) \r\n---\r\n\r\nEcosystem mapping for Colombia, only the ecosystem types in bold font in the legend above are present in the geographic area, within the period observed in this analysis.\r\n\r\nThe output obtained in the first version of the modelled, called \"_older modelled ecosystem type colombia_\", where the temporary results presented in Cali during the COP16 on Biodiversity, in which a total of 21 (out of 30) ecosystem functional groups were mapped with a high level of confidence (accuracy >95%). The first round of result, could map with a high level of confidence 78.6% (89,942,816 hectares) of the total area of extension of Colombia.\r\n\r\nThe revised version of the model, called \"_modelled colombia ecosystem type_\" now achieve 98.6% of accuracy (when compared with the reference data used to train the model) and the results will be validated by others colombian agencies involved in ecosystem mapping efforts.   ",
    "sectionType" : "BODY",
    "documentedUrns" : [ ],
    "eventType" : null,
    "variables" : { }
  },
  "colombia.ecosystemextent.ecosystemtype#Definition#Introduction" : {
    "trigger" : "DEFINITION",
    "sectionRole" : "INTRODUCTION",
    "section" : "Introduction",
    "documentedId" : "colombia.ecosystemextent.ecosystemtype",
    "extended" : null,
    "template" : "@section(Ecosystem Extent)\r\n\r\nThe Ecosystem Extent Account is the first SEEA EA@cite(UNDESA2021) account. It records the total area of each ecosystem, classified by type within a specified ecosystem accounting area (e.g., nation, province, river basin, protected area). Ecosystem extent accounts are measured over time in ecosystem accounting areas by ecosystem type, thus illustrating the changes in extent from one ecosystem type to another over the accounting period.\r\n\r\nEcosystems are defined as units whose functioning is governed by resources, ambient environmental conditions, disturbance regimes, biotic interactions, and human activity. Ecosystems in this context should not be confused with habitats (provided by ecosystems for particular species). \r\n\r\nIUCN’s Global Ecosystem Typology (GET)@cite(KeithEtAl2020) has been selected as the SEEA Ecosystem Type reference classification for the purposes of international reporting and comparison. The IUCN GET improves on past ecosystem extent data, as many past SEEA EA applications relied exclusively on land cover data@cite(UN2017).  \r\n\r\nA full ecosystem extent account includes gross changes (additions and reductions), as well as net change between opening and closing years among individual ecosystem assets of the same ecosystem type and for each accounting period. Each change can be classified into managed expansion/reduction (changes due to direct human activity, such as forest clearing for agricultural land) or natural expansion/regression (changes resulting from natural processes, such as forest succession). Finally, ecosystem extent can be recorded as a change matrix that quantifies the specific change of each ecosystem type into another ecosystem type between an opening and closing year.",
    "sectionType" : "BODY",
    "documentedUrns" : [ ],
    "eventType" : null,
    "variables" : { }
  },
  "colombia.ecosystemextent.ecosystemtype#Definition#Conclusions" : {
    "trigger" : "DEFINITION",
    "sectionRole" : "CONCLUSIONS",
    "section" : "Conclusions",
    "documentedId" : "colombia.ecosystemextent.ecosystemtype",
    "extended" : null,
    "template" : "In this approach, the cleaned database, which contained approximately 26,000 combinations (scenarios), was reduced to 2,227 records, which constitute the final lookup table, used within the decision tree model to identify ETs. This condensed table contains only the essential information, allowing for quick and efficient consultation of the results, while ensuring that accuracy in the representation of ecosystems is not lost.  \r\n\r\n",
    "sectionType" : "BODY",
    "documentedUrns" : [ ],
    "eventType" : null,
    "variables" : { }
  }
}